tests/resources/directpayment/enableWallet/enableWalletRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.ws.payline.experian.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:enableWalletRequest>
            <ns1:contractNumber/>
            <ns1:cardInd xsi:nil="true"/>
            <ns1:walletId/>
        </ns1:enableWalletRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>